
export const tarrifTabs = [
    { value: 'express', content: 'Экспресс' },
    { value: 'standart', content: 'Стандарт' },
    { value: 'econom', content: 'Эконом' },
    { value: 'super', content: 'Супер' },
]

export const termTabs = [
    { content: '1 мес', value: 1 },
    { content: '2 мес', value: 2 },
    { content: '3 мес', value: 3 },
    { content: '4 мес', value: 4 },
    { content: '5 мес', value: 5 },
    { content: '6 мес', value: 6 },
    { content: '7 мес', value: 7 },
    { content: '8 мес', value: 8 },
    { content: '9 мес', value: 9 },
    { content: '10 мес', value: 10 },
    { content: '11 мес', value: 11 },
    { content: '12 мес', value: 12 },
]

export interface ITariffItem {
    appreciationFactors: any,
    mainConditions: string[],
    documents: string[],
}

export const tariffItems: Record<string, any> = {
    econom: {
        appreciationFactors: [
            1.090, 1.124, 1.158, 1.192, 1.226, 1.260, 1.294, 1.328, 1.362, 1.396, 1.430,
            1.464,
        ],
        mainConditions: [
            '2 поручителя',
            'Возраст от 22 лет и выше',
            'Макс. сумма финансирования до 150 000 руб.',
            'Первоначальный взнос от 25%',
            'Проживание в Республике Ингушетия',
            'Гражданство РФ',
        ],
        documents: [
            'Паспорт',
            'Справка о доходах за 6 мес при сумме от 30 000 руб',
        ],
    },
    standart: {
        appreciationFactors: [
            1.100, 1.142, 1.184, 1.226, 1.268, 1.310, 1.352, 1.394, 1.436, 1.478,
            1.520, 1.562,
        ],
        mainConditions: [
            '1 поручитель',
            'Возраст от 22 лет и выше',
            'Макс. сумма финансирования до 150 000 руб.',
            'Первоначальный взнос от 25%',
            'Проживание в Республике Ингушетия',
            'Гражданство РФ',
        ],
        documents: [
            'Паспорт гражданина РФ',
            'Справка о доходах за 6 мес при сумме от 30 000 руб',
        ],
    },
    express: {
        appreciationFactors: [
            1.110, 1.160, 1.210, 1.260, 1.310, 1.360, 1.410, 1.460, 1.510, 1.560, 1.610, 1.660,
        ],
        mainConditions: [
            'Без поручителей',
            'Возраст от 22 лет и выше',
            'Макс. сумма финансирования до 150 000 руб.',
            'Первоначальный взнос от 25%',
            'Проживание в Республике Ингушетия',
            'Гражданство РФ',
        ],
        documents: [
            'Паспорт гражданина РФ',
            'Справка о доходах за 6 мес при сумме от 30 000 руб',
        ],
    },
    super: {
        appreciationFactors: [
            1.070, 1.104, 1.138, 1.172, 1.206, 1.240, 1.274, 1.308, 1.342, 1.376, 1.410, 1.444,
        ],
        mainConditions: [
            'Без поручителей',
            'Возраст от 22 лет и выше',
            'Макс. сумма финансирования до 150 000 руб.',
            'Первоначальный взнос от 25%',
            'Проживание в Республике Ингушетия',
            'Гражданство РФ',
        ],
        documents: [
            'Паспорт гражданина РФ',
            'Справка о доходах за 6 мес при сумме от 30 000 руб',
        ],
    },
    premium: {
        appreciationFactors: 0.024,
        mainConditions: [
            'Без поручителей',
            'Возраст от 20 лет и старше',
            'Первоначальный взонс',
            'Прописка в Республике Ингушетия',
            'Минимальный стаж работы не менее 1 года',
            'Гражданство РФ',
        ],
        documents: [
            'Паспорт гражданина РФ',
            'Справка о доходах за последние 6 мес',
        ],
    },
}
